trade_exp/src/Catalogs/НаборыДополнительныхРеквизитовИСведений/НаборыДополнительныхРеквизитовИСведений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НаборыДополнительныхРеквизитовИСведений</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="1a7c774d-5b86-4051-b797-3081e19fa30a">
    <name>ДополнительныеСведения</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="00949768-5833-4fe2-8752-b009d1bceef8">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="167455d1-6658-409f-834c-f6ccfe7b25de">
      <name>ПометкаУдаления</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1300c46e-24d4-45cf-a899-3d26b5cf0b50">
      <name>ИмяПредопределенногоНабора</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/НаборыДополнительныхРеквизитовИСведений/ObjectModule.bsl
&После("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ)
	ТЧ_ДополнительныеСведения_УдалитьДубли(Отказ);
КонецПроцедуры

Процедура ТЧ_ДополнительныеСведения_УдалитьДубли(Отказ)  
	Если Не Отказ И ЗначениеЗаполнено(ДополнительныеСведения) Тогда 
		КолонкиГруппировок = "Свойство, ПометкаУдаления, ИмяПредопределенногоНабора";	
		ТЗ = ДополнительныеСведения.Выгрузить( , КолонкиГруппировок);  
		ТЗ.Свернуть(КолонкиГруппировок);
		ДополнительныеСведения.Загрузить(ТЗ); 
	КонецЕсли;
КонецПроцедуры
